[{
    "title": "Opening Act: Bree Kalhorn",
    "author": "",
    "id": "bree",
    "hidden": false,
    "logo": {
      "dark_mode_support": false,
      "image_name": "bree-kalhorn.jpg",
      "image_class": "",
      "dark_mode_image_name": "",
      "dark_mode_image_class": ""
    },
    "dates": [{
      "day": "Friday, April 14th"
    }],
    "description": "Bree Kalhorn first tried her hand at standup at Omaha’s own Backline Theater, and has been a crowd favorite in the local scene. Her small stature and doe eyes make her biting sense of humor all the more unexpected and hard hitting. Mature yet accessible, Bree’s comedy addresses a variety of topics and has been known to strike a chord with audiences from bar shows to colleges. She was interviewed on local television show, “Food and Laughter,” and is active on social media platforms including tiktok and instagram."
  },
  {
    "title": "Headliner: Zach Peterson",
    "author": "",
    "id": "zach",
    "hidden": false,
    "logo": {
      "dark_mode_support": false,
      "image_name": "zach-peterson.jpg",
      "image_class": "",
      "dark_mode_image_name": "",
      "dark_mode_image_class": ""
    },
    "dates": [{
      "day": "Friday, April 14th"
    }],
    "description": "Out of Omaha Nebraska, after spending time in Chicago and Los Angeles, Zach Peterson has been called “one of the funniest performers around” by Minneapolis' CityPages and Kyle Kinane says “Zach is Hilarious.” Zach has made a name for himself around the country, from Alaska to Florida for being “an affable oddball” with razor sharp jokes, headlining both clubs and festivals alike. He has worked with the likes of Tom Papa, Bobcat Goldthwait, Annie Lederman, Doug Benson and many more. Zach's first album “Midwestern Jokes for the Americas” debuted in the top 5 on the Itunes Comedy Charts in 2018. Zach has been selected for countless festivals including the prestigious Laughing Skull Comedy Festival, The Limestone Comedy Festival, 10,000 Laughs and The High Plains Comedy Festival among others. When in Omaha Zach runs the wildly popular Omaha chapter of Don't Tell Comedy and The Broken Magic Comedy collective."
  }
]